espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_struct_eco2.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Interrupt Registers */
/** Type of in_int_raw_ch0 register
 *  Raw interrupt status of RX channel 0
 */
typedef union {
    struct {
        /** in_done_ch0_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_DONE_CH0_INT
         */
        uint32_t in_done_ch0_int_raw:1;
        /** in_suc_eof_ch0_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH0_INT
         */
        uint32_t in_suc_eof_ch0_int_raw:1;
        /** in_err_eof_ch0_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH0_INT
         */
        uint32_t in_err_eof_ch0_int_raw:1;
        /** in_dscr_err_ch0_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH0_INT
         */
        uint32_t in_dscr_err_ch0_int_raw:1;
        /** in_dscr_empty_ch0_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH0_INT
         */
        uint32_t in_dscr_empty_ch0_int_raw:1;
        /** infifo_ovf_ch0_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt status of AHB_DMA_INFIFO_OVF_CH0_INT
         */
        uint32_t infifo_ovf_ch0_int_raw:1;
        /** infifo_udf_ch0_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt status of AHB_DMA_INFIFO_UDF_CH0_INT
         */
        uint32_t infifo_udf_ch0_int_raw:1;
        /** in_ahbinf_resp_err_ch0_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH0_INT
         */
        uint32_t in_ahbinf_resp_err_ch0_int_raw:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_in_int_raw_ch0_reg_t;


/** Group: Status Registers */
/** Type of in_int_st_ch0 register
 *  Masked interrupt status of RX channel 0
 */
typedef union {
    struct {
        /** in_done_ch0_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_DONE_CH0_INT
         */
        uint32_t in_done_ch0_int_st:1;
        /** in_suc_eof_ch0_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH0_INT
         */
        uint32_t in_suc_eof_ch0_int_st:1;
        /** in_err_eof_ch0_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH0_INT
         */
        uint32_t in_err_eof_ch0_int_st:1;
        /** in_dscr_err_ch0_int_st : RO; bitpos: [3]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH0_INT
         */
        uint32_t in_dscr_err_ch0_int_st:1;
        /** in_dscr_empty_ch0_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH0_INT
         */
        uint32_t in_dscr_empty_ch0_int_st:1;
        /** infifo_ovf_ch0_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status of AHB_DMA_INFIFO_OVF_CH0_INT
         */
        uint32_t infifo_ovf_ch0_int_st:1;
        /** infifo_udf_ch0_int_st : RO; bitpos: [6]; default: 0;
         *  The masked interrupt status of AHB_DMA_INFIFO_UDF_CH0_INT
         */
        uint32_t infifo_udf_ch0_int_st:1;
        /** in_ahbinf_resp_err_ch0_int_st : RO; bitpos: [7]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH0_INT
         */
        uint32_t in_ahbinf_resp_err_ch0_int_st:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_in_int_st_ch0_reg_t;

/** Type of in_int_ena_ch0 register
 *  Interrupt enable bits of RX channel 0
 */
typedef union {
    struct {
        /** in_done_ch0_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_DONE_CH0_INT
         */
        uint32_t in_done_ch0_int_ena:1;
        /** in_suc_eof_ch0_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_SUC_EOF_CH0_INT
         */
        uint32_t in_suc_eof_ch0_int_ena:1;
        /** in_err_eof_ch0_int_ena : R/W; bitpos: [2]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_ERR_EOF_CH0_INT
         */
        uint32_t in_err_eof_ch0_int_ena:1;
        /** in_dscr_err_ch0_int_ena : R/W; bitpos: [3]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH0_INT
         */
        uint32_t in_dscr_err_ch0_int_ena:1;
        /** in_dscr_empty_ch0_int_ena : R/W; bitpos: [4]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH0_INT
         */
        uint32_t in_dscr_empty_ch0_int_ena:1;
        /** infifo_ovf_ch0_int_ena : R/W; bitpos: [5]; default: 0;
         *  Write 1 to enable AHB_DMA_INFIFO_OVF_CH0_INT
         */
        uint32_t infifo_ovf_ch0_int_ena:1;
        /** infifo_udf_ch0_int_ena : R/W; bitpos: [6]; default: 0;
         *  Write 1 to enable AHB_DMA_INFIFO_UDF_CH0_INT
         */
        uint32_t infifo_udf_ch0_int_ena:1;
        /** in_ahbinf_resp_err_ch0_int_ena : R/W; bitpos: [7]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_RESP_ERR_CH0_INT
         */
        uint32_t in_ahbinf_resp_err_ch0_int_ena:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_in_int_ena_ch0_reg_t;

/** Type of in_int_clr_ch0 register
 *  Interrupt clear bits of RX channel 0
 */
typedef union {
    struct {
        /** in_done_ch0_int_clr : WT; bitpos: [0]; default: 0;
         *  Write 1 to clear AHB_DMA_IN_DONE_CH0_INT
         */
        uint32_t in_done_ch0_int_clr:1;
        /** in_suc_eof_ch0_int_clr : WT; bitpos: [1]; default: 0;
         *  Write 1 to clear AHB_DMA_IN_SUC_EOF_CH0_INT
         */
        uint32_t in_suc_eof_ch0_int_clr:1;
        /** in_err_eof_ch0_int_clr : WT; bitpos: [2]; default: 0;
         *  Write 1 to clear AHB_DMA_IN_ERR_EOF_CH0_INT
         */
        uint32_t in_err_eof_ch0_int_clr:1;
        /** in_dscr_err_ch0_int_clr : WT; bitpos: [3]; default: 0;
         *  Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH0_INT
         */
        uint32_t in_dscr_err_ch0_int_clr:1;
        /** in_dscr_empty_ch0_int_clr : WT; bitpos: [4]; default: 0;
         *  Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH0_INT
         */
        uint32_t in_dscr_empty_ch0_int_clr:1;
        /** infifo_ovf_ch0_int_clr : WT; bitpos: [5]; default: 0;
         *  Write 1 to clear AHB_DMA_INFIFO_OVF_CH0_INT
         */
        uint32_t infifo_ovf_ch0_int_clr:1;
        /** infifo_udf_ch0_int_clr : WT; bitpos: [6]; default: 0;
         *  Write 1 to clear AHB_DMA_INFIFO_UDF_CH0_INT
         */
        uint32_t infifo_udf_ch0_int_clr:1;
        /** in_ahbinf_resp_err_ch0_int_clr : WT; bitpos: [7]; default: 0;
         *  Write 1 to clear AHB_DMA_IN_RESP_ERR_CH0_INT
         */
        uint32_t in_ahbinf_resp_err_ch0_int_clr:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_in_int_clr_ch0_reg_t;

/** Type of in_int_raw_ch1 register
 *  Raw interrupt status of RX channel 1
 */
typedef union {
    struct {
        /** in_done_ch1_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_DONE_CH1_INT
         */
        uint32_t in_done_ch1_int_raw:1;
        /** in_suc_eof_ch1_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH1_INT
         */
        uint32_t in_suc_eof_ch1_int_raw:1;
        /** in_err_eof_ch1_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH1_INT
         */
        uint32_t in_err_eof_ch1_int_raw:1;
        /** in_dscr_err_ch1_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH1_INT
         */
        uint32_t in_dscr_err_ch1_int_raw:1;
        /** in_dscr_empty_ch1_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH1_INT
         */
        uint32_t in_dscr_empty_ch1_int_raw:1;
        /** infifo_ovf_ch1_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt status of AHB_DMA_INFIFO_OVF_CH1_INT
         */
        uint32_t infifo_ovf_ch1_int_raw:1;
        /** infifo_udf_ch1_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt status of AHB_DMA_INFIFO_UDF_CH1_INT
         */
        uint32_t infifo_udf_ch1_int_raw:1;
        /** in_ahbinf_resp_err_ch1_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH1_INT
         */
        uint32_t in_ahbinf_resp_err_ch1_int_raw:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_in_int_raw_ch1_reg_t;

/** Type of in_int_st_ch1 register
 *  Masked interrupt status of RX channel 1
 */
typedef union {
    struct {
        /** in_done_ch1_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_DONE_CH1_INT
         */
        uint32_t in_done_ch1_int_st:1;
        /** in_suc_eof_ch1_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH1_INT
         */
        uint32_t in_suc_eof_ch1_int_st:1;
        /** in_err_eof_ch1_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH1_INT
         */
        uint32_t in_err_eof_ch1_int_st:1;
        /** in_dscr_err_ch1_int_st : RO; bitpos: [3]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH1_INT
         */
        uint32_t in_dscr_err_ch1_int_st:1;
        /** in_dscr_empty_ch1_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH1_INT
         */
        uint32_t in_dscr_empty_ch1_int_st:1;
        /** infifo_ovf_ch1_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status of AHB_DMA_INFIFO_OVF_CH1_INT
         */
        uint32_t infifo_ovf_ch1_int_st:1;
        /** infifo_udf_ch1_int_st : RO; bitpos: [6]; default: 0;
         *  The masked interrupt status of AHB_DMA_INFIFO_UDF_CH1_INT
         */
        uint32_t infifo_udf_ch1_int_st:1;
        /** in_ahbinf_resp_err_ch1_int_st : RO; bitpos: [7]; default: 0;
         *  The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH1_INT
         */
        uint32_t in_ahbinf_resp_err_ch1_int_st:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_in_int_st_ch1_reg_t;

/** Type of in_int_ena_ch1 register
 *  Interrupt enable bits of RX channel 1
 */
typedef union {
    struct {
        /** in_done_ch1_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_DONE_CH1_INT
         */
        uint32_t in_done_ch1_int_ena:1;
        /** in_suc_eof_ch1_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_SUC_EOF_CH1_INT
         */
        uint32_t in_suc_eof_ch1_int_ena:1;
        /** in_err_eof_ch1_int_ena : R/W; bitpos: [2]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_ERR_EOF_CH1_INT
         */
        uint32_t in_err_eof_ch1_int_ena:1;
        /** in_dscr_err_ch1_int_ena : R/W; bitpos: [3]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH1_INT
         */
        uint32_t in_dscr_err_ch1_int_ena:1;
        /** in_dscr_empty_ch1_int_ena : R/W; bitpos: [4]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH1_INT
         */
        uint32_t in_dscr_empty_ch1_int_ena:1;
        /** infifo_ovf_ch1_int_ena : R/W; bitpos: [5]; default: 0;
         *  Write 1 to enable AHB_DMA_INFIFO_OVF_CH1_INT
         */
        uint32_t infifo_ovf_ch1_int_ena:1;
        /** infifo_udf_ch1_int_ena : R/W; bitpos: [6]; default: 0;
         *  Write 1 to enable AHB_DMA_INFIFO_UDF_CH1_INT
         */
        uint32_t infifo_udf_ch1_int_ena:1;
        /** in_ahbinf_resp_err_ch1_int_ena : R/W; bitpos: [7]; default: 0;
         *  Write 1 to enable AHB_DMA_IN_RESP_ERR_CH1_INT
         */
        uint32_t in_ahbinf_resp_err_ch1_int_ena:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_in_int_ena_ch1_reg_t;

