espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_struct_eco2.h
/** Type of out_int_raw_ch2 register
 *  //Raw interrupt status of TX channel 2
 */
typedef union {
    struct {
        /** out_done_ch2_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUT_DONE_CH2_INT
         */
        uint32_t out_done_ch2_int_raw:1;
        /** out_eof_ch2_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUT_EOF_CH2_INT
         */
        uint32_t out_eof_ch2_int_raw:1;
        /** out_dscr_err_ch2_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUT_DSCR_ERR_CH2_INT
         */
        uint32_t out_dscr_err_ch2_int_raw:1;
        /** out_total_eof_ch2_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH2_INT
         */
        uint32_t out_total_eof_ch2_int_raw:1;
        /** outfifo_ovf_ch2_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUTFIFO_OVF_CH2_INT
         */
        uint32_t outfifo_ovf_ch2_int_raw:1;
        /** outfifo_udf_ch2_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUTFIFO_UDF_CH2_INT
         */
        uint32_t outfifo_udf_ch2_int_raw:1;
        /** out_ahbinf_resp_err_ch2_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt status of AHB_DMA_OUT_RESP_ERR_CH2_INT
         */
        uint32_t out_ahbinf_resp_err_ch2_int_raw:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_raw_ch2_reg_t;

/** Type of out_int_st_ch2 register
 *  Masked interrupt status of TX channel 2
 */
typedef union {
    struct {
        /** out_done_ch2_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_DONE_CH2_INT
         */
        uint32_t out_done_ch2_int_st:1;
        /** out_eof_ch2_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_EOF_CH2_INT
         */
        uint32_t out_eof_ch2_int_st:1;
        /** out_dscr_err_ch2_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_DSCR_ERR_CH2_INT
         */
        uint32_t out_dscr_err_ch2_int_st:1;
        /** out_total_eof_ch2_int_st : RO; bitpos: [3]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH2_INT
         */
        uint32_t out_total_eof_ch2_int_st:1;
        /** outfifo_ovf_ch2_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUTFIFO_OVF_CH2_INT
         */
        uint32_t outfifo_ovf_ch2_int_st:1;
        /** outfifo_udf_ch2_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUTFIFO_UDF_CH2_INT
         */
        uint32_t outfifo_udf_ch2_int_st:1;
        /** out_ahbinf_resp_err_ch2_int_st : RO; bitpos: [6]; default: 0;
         *  The masked interrupt status of AHB_DMA_OUT_RESP_ERR_CH2_INT
         */
        uint32_t out_ahbinf_resp_err_ch2_int_st:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_st_ch2_reg_t;

/** Type of out_int_ena_ch2 register
 *  Interrupt enable bits of TX channel 2
 */
typedef union {
    struct {
        /** out_done_ch2_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_DONE_CH2_INT
         */
        uint32_t out_done_ch2_int_ena:1;
        /** out_eof_ch2_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_EOF_CH2_INT
         */
        uint32_t out_eof_ch2_int_ena:1;
        /** out_dscr_err_ch2_int_ena : R/W; bitpos: [2]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH2_INT
         */
        uint32_t out_dscr_err_ch2_int_ena:1;
        /** out_total_eof_ch2_int_ena : R/W; bitpos: [3]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH2_INT
         */
        uint32_t out_total_eof_ch2_int_ena:1;
        /** outfifo_ovf_ch2_int_ena : R/W; bitpos: [4]; default: 0;
         *  Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH2_INT
         */
        uint32_t outfifo_ovf_ch2_int_ena:1;
        /** outfifo_udf_ch2_int_ena : R/W; bitpos: [5]; default: 0;
         *  Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH2_INT
         */
        uint32_t outfifo_udf_ch2_int_ena:1;
        /** out_ahbinf_resp_err_ch2_int_ena : R/W; bitpos: [6]; default: 0;
         *  Write 1 to enable AHB_DMA_OUT_RESP_ERR_CH2_INT
         */
        uint32_t out_ahbinf_resp_err_ch2_int_ena:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_ena_ch2_reg_t;

/** Type of out_int_clr_ch2 register
 *  Interrupt clear bits of TX channel 2
 */
typedef union {
    struct {
        /** out_done_ch2_int_clr : WT; bitpos: [0]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_DONE_CH2_INT
         */
        uint32_t out_done_ch2_int_clr:1;
        /** out_eof_ch2_int_clr : WT; bitpos: [1]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_EOF_CH2_INT
         */
        uint32_t out_eof_ch2_int_clr:1;
        /** out_dscr_err_ch2_int_clr : WT; bitpos: [2]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_DSCR_ERR_CH2_INT
         */
        uint32_t out_dscr_err_ch2_int_clr:1;
        /** out_total_eof_ch2_int_clr : WT; bitpos: [3]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_TOTAL_EOF_CH2_INT
         */
        uint32_t out_total_eof_ch2_int_clr:1;
        /** outfifo_ovf_ch2_int_clr : WT; bitpos: [4]; default: 0;
         *  Write 1 to clear AHB_DMA_OUTFIFO_OVF_CH2_INT
         */
        uint32_t outfifo_ovf_ch2_int_clr:1;
        /** outfifo_udf_ch2_int_clr : WT; bitpos: [5]; default: 0;
         *  Write 1 to clear AHB_DMA_OUTFIFO_UDF_CH2_INT
         */
        uint32_t outfifo_udf_ch2_int_clr:1;
        /** out_ahbinf_resp_err_ch2_int_clr : WT; bitpos: [6]; default: 0;
         *  Write 1 to clear AHB_DMA_OUT_RESP_ERR_CH2_INT
         */
        uint32_t out_ahbinf_resp_err_ch2_int_clr:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} ahb_dma_out_int_clr_ch2_reg_t;

/** Type of ahb_test register
 *  only for test
 */
typedef union {
    struct {
        /** ahb_testmode : R/W; bitpos: [2:0]; default: 0;
         *  reserved
         */
        uint32_t ahb_testmode:3;
        uint32_t reserved_3:1;
        /** ahb_testaddr : R/W; bitpos: [5:4]; default: 0;
         *  reserved
         */
        uint32_t ahb_testaddr:2;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} ahb_dma_ahb_test_reg_t;

/** Type of misc_conf register
 *  reserved
 */
typedef union {
    struct {
        /** ahbm_rst_inter : R/W; bitpos: [0]; default: 0;
         *  Write 1 and then 0 to reset the internal AHB FSM
         */
        uint32_t ahbm_rst_inter:1;
        uint32_t reserved_1:1;
        /** arb_pri_dis : R/W; bitpos: [2]; default: 0;
         *  Configures whether to disable the fixed-priority channel arbitration.
         *  0: Enable
         *  1: Disable
         */
        uint32_t arb_pri_dis:1;
        /** clk_en : R/W; bitpos: [3]; default: 0;
         *  Configures clock gating.
         *  0: Support clock only when the application writes registers.
         *  1: Always force the clock on for registers.
         */
        uint32_t clk_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_misc_conf_reg_t;

/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 2410220;
         *  Version control register
         */
        uint32_t date:32;
    };
    uint32_t val;
} ahb_dma_date_reg_t;

