espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_struct_eco2.h
/** Type of in_conf0_ch0 register
 *  Configuration register 0 of RX channel 0
 */
typedef union {
    struct {
        /** in_rst_ch0 : R/W; bitpos: [0]; default: 0;
         *  Write 1 and then 0 to reset AHB_DMA channel 0 RX FSM and RX FIFO pointer.
         */
        uint32_t in_rst_ch0:1;
        /** in_loop_test_ch0 : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t in_loop_test_ch0:1;
        /** indscr_burst_en_ch0 : R/W; bitpos: [2]; default: 0;
         *  Configures whether to enable INCR burst transfer for RX channel 0 to read
         *  descriptors.
         *  0: Disable
         *  1: Enable
         */
        uint32_t indscr_burst_en_ch0:1;
        uint32_t reserved_3:1;
        /** mem_trans_en_ch0 : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable memory-to-memory data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t mem_trans_en_ch0:1;
        /** in_etm_en_ch0 : R/W; bitpos: [5]; default: 0;
         *  Configures whether to enable ETM control for RX channel0.
         *  0: Disable
         *  1: Enable
         */
        uint32_t in_etm_en_ch0:1;
        /** in_data_burst_mode_sel_ch0 : R/W; bitpos: [7:6]; default: 0;
         *  Configures max burst size for Rx channel0.
         *  2'b00: single
         *  2'b01: incr4
         *  2'b10: incr8
         *  2'b11: incr16
         */
        uint32_t in_data_burst_mode_sel_ch0:2;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_in_conf0_ch0_reg_t;

/** Type of in_conf1_ch0 register
 *  Configuration register 1 of RX channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** in_check_owner_ch0 : R/W; bitpos: [12]; default: 0;
         *  Configures whether to enable owner bit check for RX channel 0.
         *  0: Disable
         *  1: Enable
         */
        uint32_t in_check_owner_ch0:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} ahb_dma_in_conf1_ch0_reg_t;

/** Type of infifo_status_ch0 register
 *  Receive FIFO status of RX channel 0
 */
typedef union {
    struct {
        /** infifo_full_ch0 : RO; bitpos: [0]; default: 1;
         *  Represents whether L1 RX FIFO is full.
         *  0: Not Full
         *  1: Full
         */
        uint32_t infifo_full_ch0:1;
        /** infifo_empty_ch0 : RO; bitpos: [1]; default: 1;
         *  Represents whether L1 RX FIFO is empty.
         *  0: Not empty
         *  1: Empty
         */
        uint32_t infifo_empty_ch0:1;
        uint32_t reserved_2:6;
        /** infifo_cnt_ch0 : RO; bitpos: [14:8]; default: 0;
         *  Represents the number of data bytes in L1 RX FIFO for RX channel 0
         */
        uint32_t infifo_cnt_ch0:7;
        uint32_t reserved_15:8;
        /** in_remain_under_1b_ch0 : RO; bitpos: [23]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_1b_ch0:1;
        /** in_remain_under_2b_ch0 : RO; bitpos: [24]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_2b_ch0:1;
        /** in_remain_under_3b_ch0 : RO; bitpos: [25]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_3b_ch0:1;
        /** in_remain_under_4b_ch0 : RO; bitpos: [26]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_4b_ch0:1;
        /** in_buf_hungry_ch0 : RO; bitpos: [27]; default: 0;
         *  reserved
         */
        uint32_t in_buf_hungry_ch0:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} ahb_dma_infifo_status_ch0_reg_t;

/** Type of in_pop_ch0 register
 *  Receive FIFO status of RX channel 0
 */
typedef union {
    struct {
        /** infifo_rdata_ch0 : RO; bitpos: [11:0]; default: 2048;
         *  Represents the data popped from AHB_DMA FIFO.
         */
        uint32_t infifo_rdata_ch0:12;
        /** infifo_pop_ch0 : WT; bitpos: [12]; default: 0;
         *  Configures whether to pop data from AHB_DMA FIFO.
         *  0: Invalid. No effect
         *  1: Pop
         */
        uint32_t infifo_pop_ch0:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} ahb_dma_in_pop_ch0_reg_t;

/** Type of in_link_ch0 register
 *  Receive FIFO status of RX channel 0
 */
typedef union {
    struct {
        /** inlink_auto_ret_ch0 : R/W; bitpos: [0]; default: 1;
         *  Configures whether to return to current receive descriptor's address when there are
         *  some errors in current receiving data.
         *  0: Not return
         *  1: Return
         *  .
         */
        uint32_t inlink_auto_ret_ch0:1;
        /** inlink_stop_ch0 : WT; bitpos: [1]; default: 0;
         *  Configures whether to stop AHB_DMA's RX channel 0 from receiving data.
         *  0: Invalid. No effect
         *  1: Stop
         */
        uint32_t inlink_stop_ch0:1;
        /** inlink_start_ch0 : WT; bitpos: [2]; default: 0;
         *  Configures whether to enable AHB_DMA's RX channel 0 for data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t inlink_start_ch0:1;
        /** inlink_restart_ch0 : WT; bitpos: [3]; default: 0;
         *  Configures whether to restart RX channel 0 for AHB_DMA transfer.
         *  0: Invalid. No effect
         *  1: Restart
         */
        uint32_t inlink_restart_ch0:1;
        /** inlink_park_ch0 : RO; bitpos: [4]; default: 1;
         *  Represents the status of the receive descriptor's FSM.
         *  0: Running
         *  1: Idle
         */
        uint32_t inlink_park_ch0:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} ahb_dma_in_link_ch0_reg_t;

/** Type of in_state_ch0 register
 *  Receive status of RX channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_addr_ch0 : RO; bitpos: [17:0]; default: 0;
         *  reserved
         */
        uint32_t inlink_dscr_addr_ch0:18;
        /** in_dscr_state_ch0 : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t in_dscr_state_ch0:2;
        /** in_state_ch0 : RO; bitpos: [22:20]; default: 0;
         *  Represents the address of the lower 18 bits of the next receive descriptor to be
         *  processed.
         */
        uint32_t in_state_ch0:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} ahb_dma_in_state_ch0_reg_t;

/** Type of in_suc_eof_des_addr_ch0 register
 *  Receive descriptor address when EOF occurs on RX channel 0
 */
typedef union {
    struct {
        /** in_suc_eof_des_addr_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the receive descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t in_suc_eof_des_addr_ch0:32;
    };
    uint32_t val;
} ahb_dma_in_suc_eof_des_addr_ch0_reg_t;

/** Type of in_err_eof_des_addr_ch0 register
 *  Receive descriptor address when errors occur of RX channel 0
 */
typedef union {
    struct {
        /** in_err_eof_des_addr_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the receive descriptor when there are some errors in the
         *  currently received data.
         */
        uint32_t in_err_eof_des_addr_ch0:32;
    };
    uint32_t val;
} ahb_dma_in_err_eof_des_addr_ch0_reg_t;

/** Type of in_dscr_ch0 register
 *  Current receive descriptor address of RX channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the next receive descriptor x+1 pointed by the current
         *  receive descriptor that has already been fetched.
         */
        uint32_t inlink_dscr_ch0:32;
    };
    uint32_t val;
} ahb_dma_in_dscr_ch0_reg_t;

