espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_struct_eco2.h
/** Type of in_dscr_bf0_ch0 register
 *  The last receive descriptor address of RX channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_bf0_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the current receive descriptor x that has already been
         *  fetched.
         */
        uint32_t inlink_dscr_bf0_ch0:32;
    };
    uint32_t val;
} ahb_dma_in_dscr_bf0_ch0_reg_t;

/** Type of in_dscr_bf1_ch0 register
 *  The second-to-last receive descriptor address of RX channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_bf1_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the previous receive descriptor x-1 that has already been
         *  fetched.
         */
        uint32_t inlink_dscr_bf1_ch0:32;
    };
    uint32_t val;
} ahb_dma_in_dscr_bf1_ch0_reg_t;

/** Type of in_peri_ch0 register
 *  Priority register of RX channel 0
 */
typedef union {
    struct {
        /** rx_pri_ch0 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the priority of RX channel 0.The larger of the value, the higher of the
         *  priority..
         */
        uint32_t rx_pri_ch0:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_in_peri_ch0_reg_t;

/** Type of in_peri_sel_ch0 register
 *  Peripheral selection register of RX channel 0
 */
typedef union {
    struct {
        /** peri_in_sel_ch0 : R/W; bitpos: [5:0]; default: 63;
         *  Configures the peripheral connected to RX channel 0.
         *  0: Dummy
         *  1: SPI2
         *  2: UHCI0
         *  3: I2S0
         *  4: Dummy
         *  5: Dummy
         *  6: AES
         *  7: SHA
         *  8: ADC_DAC
         *  9: PARL_IO
         *  10: Dummy
         *  11~15: Dummy
         */
        uint32_t peri_in_sel_ch0:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} ahb_dma_in_peri_sel_ch0_reg_t;

/** Type of out_conf0_ch0 register
 *  Configuration register 0 of TX channel 0
 */
typedef union {
    struct {
        /** out_rst_ch0 : R/W; bitpos: [0]; default: 0;
         *  Configures the reset state of AHB_DMA channel 0 TX FSM and TX FIFO pointer.
         *  0: Release reset
         *  1: Reset
         */
        uint32_t out_rst_ch0:1;
        /** out_loop_test_ch0 : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t out_loop_test_ch0:1;
        /** out_auto_wrback_ch0 : R/W; bitpos: [2]; default: 0;
         *  Configures whether to enable automatic outlink write-back when all the data in TX
         *  FIFO has been transmitted.
         *  0: Disable
         *  1: Enable
         */
        uint32_t out_auto_wrback_ch0:1;
        /** out_eof_mode_ch0 : R/W; bitpos: [3]; default: 1;
         *  Configures when to generate EOF flag.
         *  0: EOF flag for TX channel 0 is generated when data to be transmitted has been
         *  pushed into FIFO in AHB_DMA.
         *  1: EOF flag for TX channel 0 is generated when data to be transmitted has been
         *  popped from FIFO in AHB_DMA.
         */
        uint32_t out_eof_mode_ch0:1;
        /** outdscr_burst_en_ch0 : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable INCR burst transfer for TX channel 0 reading
         *  descriptors.
         *  0: Disable
         *  1: Enable
         */
        uint32_t outdscr_burst_en_ch0:1;
        uint32_t reserved_5:1;
        /** out_etm_en_ch0 : R/W; bitpos: [6]; default: 0;
         *  Configures whether to enable ETM control for TX channel 0.
         *  0: Disable
         *  1: Enable
         */
        uint32_t out_etm_en_ch0:1;
        uint32_t reserved_7:1;
        /** out_data_burst_mode_sel_ch0 : R/W; bitpos: [9:8]; default: 0;
         *  Configures max burst size for TX channel0.
         *  2'b00: single
         *  2'b01: incr4
         *  2'b10: incr8
         *  2'b11: incr16
         */
        uint32_t out_data_burst_mode_sel_ch0:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} ahb_dma_out_conf0_ch0_reg_t;

/** Type of out_conf1_ch0 register
 *  Configuration register 1 of TX channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** out_check_owner_ch0 : R/W; bitpos: [12]; default: 0;
         *  Configures whether to enable owner bit check for TX channel 0.
         *  0: Disable
         *  1: Enable
         */
        uint32_t out_check_owner_ch0:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} ahb_dma_out_conf1_ch0_reg_t;

/** Type of outfifo_status_ch0 register
 *  Receive FIFO status of RX channel 0
 */
typedef union {
    struct {
        /** outfifo_full_ch0 : RO; bitpos: [0]; default: 0;
         *  Represents whether L1 TX FIFO is full.
         *  0: Not Full
         *  1: Full
         */
        uint32_t outfifo_full_ch0:1;
        /** outfifo_empty_ch0 : RO; bitpos: [1]; default: 1;
         *  Represents whether L1 TX FIFO is empty.
         *  0: Not empty
         *  1: Empty
         */
        uint32_t outfifo_empty_ch0:1;
        uint32_t reserved_2:6;
        /** outfifo_cnt_ch0 : RO; bitpos: [14:8]; default: 0;
         *  Represents the number of data bytes in L1 TX FIFO for TX channel 0
         */
        uint32_t outfifo_cnt_ch0:7;
        uint32_t reserved_15:8;
        /** out_remain_under_1b_ch0 : RO; bitpos: [23]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_1b_ch0:1;
        /** out_remain_under_2b_ch0 : RO; bitpos: [24]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_2b_ch0:1;
        /** out_remain_under_3b_ch0 : RO; bitpos: [25]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_3b_ch0:1;
        /** out_remain_under_4b_ch0 : RO; bitpos: [26]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_4b_ch0:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} ahb_dma_outfifo_status_ch0_reg_t;

/** Type of out_push_ch0 register
 *  Push control register of TX channel 0
 */
typedef union {
    struct {
        /** outfifo_wdata_ch0 : R/W; bitpos: [8:0]; default: 0;
         *  Configures whether to push data into AHB_DMA FIFO.
         *  0: Invalid. No effect
         *  1: Push
         */
        uint32_t outfifo_wdata_ch0:9;
        /** outfifo_push_ch0 : WT; bitpos: [9]; default: 0;
         *  Configures the data that need to be pushed into AHB_DMA FIFO.
         */
        uint32_t outfifo_push_ch0:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} ahb_dma_out_push_ch0_reg_t;

/** Type of out_link_ch0 register
 *  Push control register of TX channel 0
 */
typedef union {
    struct {
        /** outlink_stop_ch0 : WT; bitpos: [0]; default: 0;
         *  Configures whether to stop AHB_DMA's TX channel 0 from transmitting data.
         *  0: Invalid. No effect
         *  1: Stop
         */
        uint32_t outlink_stop_ch0:1;
        /** outlink_start_ch0 : WT; bitpos: [1]; default: 0;
         *  Configures whether to enable AHB_DMA's TX channel 0 for data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t outlink_start_ch0:1;
        /** outlink_restart_ch0 : WT; bitpos: [2]; default: 0;
         *  Configures whether to restart TX channel 0 for AHB_DMA transfer.
         *  0: Invalid. No effect
         *  1: Restart
         */
        uint32_t outlink_restart_ch0:1;
        /** outlink_park_ch0 : RO; bitpos: [3]; default: 1;
         *  Represents the status of the transmit descriptor's FSM.
         *  0: Running
         *  1: Idle
         */
        uint32_t outlink_park_ch0:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_out_link_ch0_reg_t;

/** Type of out_state_ch0 register
 *  Transmit status of TX channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_addr_ch0 : RO; bitpos: [17:0]; default: 0;
         *  Represents the lower 18 bits of the address of the next transmit descriptor to be
         *  processed.
         */
        uint32_t outlink_dscr_addr_ch0:18;
        /** out_dscr_state_ch0 : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t out_dscr_state_ch0:2;
        /** out_state_ch0 : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t out_state_ch0:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} ahb_dma_out_state_ch0_reg_t;

/** Type of out_eof_des_addr_ch0 register
 *  Transmit descriptor address when EOF occurs on TX channel 0
 */
typedef union {
    struct {
        /** out_eof_des_addr_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the transmit descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t out_eof_des_addr_ch0:32;
    };
    uint32_t val;
} ahb_dma_out_eof_des_addr_ch0_reg_t;

/** Type of out_eof_bfr_des_addr_ch0 register
 *  The last transmit descriptor address when EOF occurs on TX channel 0
 */
typedef union {
    struct {
        /** out_eof_bfr_des_addr_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the transmit descriptor before the last transmit
         *  descriptor.
         */
        uint32_t out_eof_bfr_des_addr_ch0:32;
    };
    uint32_t val;
} ahb_dma_out_eof_bfr_des_addr_ch0_reg_t;

/** Type of out_dscr_ch0 register
 *  Current transmit descriptor address of TX channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the next transmit descriptor y+1 pointed by the current
         *  transmit descriptor that has already been fetched.
         */
        uint32_t outlink_dscr_ch0:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_ch0_reg_t;

