espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_struct_eco2.h
/** Type of out_dscr_bf0_ch0 register
 *  The last transmit descriptor address of TX channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_bf0_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the current transmit descriptor y that has already been
         *  fetched.
         */
        uint32_t outlink_dscr_bf0_ch0:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_bf0_ch0_reg_t;

/** Type of out_dscr_bf1_ch0 register
 *  The second-to-last transmit descriptor address of TX channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_bf1_ch0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the previous transmit descriptor y-1 that has already
         *  been fetched.
         */
        uint32_t outlink_dscr_bf1_ch0:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_bf1_ch0_reg_t;

/** Type of out_peri_ch0 register
 *  Priority register of TX channel 0
 */
typedef union {
    struct {
        /** tx_pri_ch0 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the priority of TX channel 0.The larger of the value, the higher of the
         *  priority..
         */
        uint32_t tx_pri_ch0:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_out_peri_ch0_reg_t;

/** Type of out_peri_sel_ch0 register
 *  Peripheral selection register of TX channel 0
 */
typedef union {
    struct {
        /** peri_out_sel_ch0 : R/W; bitpos: [5:0]; default: 63;
         *  Configures the peripheral connected to TX channel 0.
         *  0: Dummy
         *  1: SPI2
         *  2: UHCI0
         *  3: I2S0
         *  4: Dummy
         *  5: Dummy
         *  6: AES
         *  7: SHA
         *  8: ADC_DAC
         *  9: PARL_IO
         *  10: Dummy
         *  11~15: Dummy
         */
        uint32_t peri_out_sel_ch0:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} ahb_dma_out_peri_sel_ch0_reg_t;

/** Type of in_conf0_ch1 register
 *  Configuration register 0 of RX channel 1
 */
typedef union {
    struct {
        /** in_rst_ch1 : R/W; bitpos: [0]; default: 0;
         *  Write 1 and then 0 to reset AHB_DMA channel 1 RX FSM and RX FIFO pointer.
         */
        uint32_t in_rst_ch1:1;
        /** in_loop_test_ch1 : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t in_loop_test_ch1:1;
        /** indscr_burst_en_ch1 : R/W; bitpos: [2]; default: 0;
         *  Configures whether to enable INCR burst transfer for RX channel 1 to read
         *  descriptors.
         *  0: Disable
         *  1: Enable
         */
        uint32_t indscr_burst_en_ch1:1;
        uint32_t reserved_3:1;
        /** mem_trans_en_ch1 : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable memory-to-memory data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t mem_trans_en_ch1:1;
        /** in_etm_en_ch1 : R/W; bitpos: [5]; default: 0;
         *  Configures whether to enable ETM control for RX channel1.
         *  0: Disable
         *  1: Enable
         */
        uint32_t in_etm_en_ch1:1;
        /** in_data_burst_mode_sel_ch1 : R/W; bitpos: [7:6]; default: 0;
         *  Configures max burst size for Rx channel1.
         *  2'b00: single
         *  2'b01: incr4
         *  2'b10: incr8
         *  2'b11: incr16
         */
        uint32_t in_data_burst_mode_sel_ch1:2;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ahb_dma_in_conf0_ch1_reg_t;

/** Type of in_conf1_ch1 register
 *  Configuration register 1 of RX channel 1
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** in_check_owner_ch1 : R/W; bitpos: [12]; default: 0;
         *  Configures whether to enable owner bit check for RX channel 1.
         *  0: Disable
         *  1: Enable
         */
        uint32_t in_check_owner_ch1:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} ahb_dma_in_conf1_ch1_reg_t;

/** Type of infifo_status_ch1 register
 *  Receive FIFO status of RX channel 1
 */
typedef union {
    struct {
        /** infifo_full_ch1 : RO; bitpos: [0]; default: 1;
         *  Represents whether L1 RX FIFO is full.
         *  0: Not Full
         *  1: Full
         */
        uint32_t infifo_full_ch1:1;
        /** infifo_empty_ch1 : RO; bitpos: [1]; default: 1;
         *  Represents whether L1 RX FIFO is empty.
         *  0: Not empty
         *  1: Empty
         */
        uint32_t infifo_empty_ch1:1;
        uint32_t reserved_2:6;
        /** infifo_cnt_ch1 : RO; bitpos: [14:8]; default: 0;
         *  Represents the number of data bytes in L1 RX FIFO for RX channel 1
         */
        uint32_t infifo_cnt_ch1:7;
        uint32_t reserved_15:8;
        /** in_remain_under_1b_ch1 : RO; bitpos: [23]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_1b_ch1:1;
        /** in_remain_under_2b_ch1 : RO; bitpos: [24]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_2b_ch1:1;
        /** in_remain_under_3b_ch1 : RO; bitpos: [25]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_3b_ch1:1;
        /** in_remain_under_4b_ch1 : RO; bitpos: [26]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_4b_ch1:1;
        /** in_buf_hungry_ch1 : RO; bitpos: [27]; default: 0;
         *  reserved
         */
        uint32_t in_buf_hungry_ch1:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} ahb_dma_infifo_status_ch1_reg_t;

/** Type of in_pop_ch1 register
 *  Receive FIFO status of RX channel 1
 */
typedef union {
    struct {
        /** infifo_rdata_ch1 : RO; bitpos: [11:0]; default: 2048;
         *  Represents the data popped from AHB_DMA FIFO.
         */
        uint32_t infifo_rdata_ch1:12;
        /** infifo_pop_ch1 : WT; bitpos: [12]; default: 0;
         *  Configures whether to pop data from AHB_DMA FIFO.
         *  0: Invalid. No effect
         *  1: Pop
         */
        uint32_t infifo_pop_ch1:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} ahb_dma_in_pop_ch1_reg_t;

