espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_struct_eco2.h
/** Type of in_suc_eof_des_addr_ch2 register
 *  Receive descriptor address when EOF occurs on RX channel 2
 */
typedef union {
    struct {
        /** in_suc_eof_des_addr_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the receive descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t in_suc_eof_des_addr_ch2:32;
    };
    uint32_t val;
} ahb_dma_in_suc_eof_des_addr_ch2_reg_t;

/** Type of in_err_eof_des_addr_ch2 register
 *  Receive descriptor address when errors occur of RX channel 2
 */
typedef union {
    struct {
        /** in_err_eof_des_addr_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the receive descriptor when there are some errors in the
         *  currently received data.
         */
        uint32_t in_err_eof_des_addr_ch2:32;
    };
    uint32_t val;
} ahb_dma_in_err_eof_des_addr_ch2_reg_t;

/** Type of in_dscr_ch2 register
 *  Current receive descriptor address of RX channel 2
 */
typedef union {
    struct {
        /** inlink_dscr_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the next receive descriptor x+1 pointed by the current
         *  receive descriptor that has already been fetched.
         */
        uint32_t inlink_dscr_ch2:32;
    };
    uint32_t val;
} ahb_dma_in_dscr_ch2_reg_t;

/** Type of in_dscr_bf0_ch2 register
 *  The last receive descriptor address of RX channel 2
 */
typedef union {
    struct {
        /** inlink_dscr_bf0_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the current receive descriptor x that has already been
         *  fetched.
         */
        uint32_t inlink_dscr_bf0_ch2:32;
    };
    uint32_t val;
} ahb_dma_in_dscr_bf0_ch2_reg_t;

/** Type of in_dscr_bf1_ch2 register
 *  The second-to-last receive descriptor address of RX channel 2
 */
typedef union {
    struct {
        /** inlink_dscr_bf1_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the previous receive descriptor x-1 that has already been
         *  fetched.
         */
        uint32_t inlink_dscr_bf1_ch2:32;
    };
    uint32_t val;
} ahb_dma_in_dscr_bf1_ch2_reg_t;

/** Type of in_peri_ch2 register
 *  Priority register of RX channel 2
 */
typedef union {
    struct {
        /** rx_pri_ch2 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the priority of RX channel 2.The larger of the value, the higher of the
         *  priority..
         */
        uint32_t rx_pri_ch2:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_in_peri_ch2_reg_t;

/** Type of in_peri_sel_ch2 register
 *  Peripheral selection register of RX channel 2
 */
typedef union {
    struct {
        /** peri_in_sel_ch2 : R/W; bitpos: [5:0]; default: 63;
         *  Configures the peripheral connected to RX channel 2.
         *  0: Dummy
         *  1: SPI2
         *  2: UHCI0
         *  3: I2S0
         *  4: Dummy
         *  5: Dummy
         *  6: AES
         *  7: SHA
         *  8: ADC_DAC
         *  9: PARL_IO
         *  10: Dummy
         *  11~15: Dummy
         */
        uint32_t peri_in_sel_ch2:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} ahb_dma_in_peri_sel_ch2_reg_t;

/** Type of out_conf0_ch2 register
 *  Configuration register 0 of TX channel 2
 */
typedef union {
    struct {
        /** out_rst_ch2 : R/W; bitpos: [0]; default: 0;
         *  Configures the reset state of AHB_DMA channel 2 TX FSM and TX FIFO pointer.
         *  0: Release reset
         *  1: Reset
         */
        uint32_t out_rst_ch2:1;
        /** out_loop_test_ch2 : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t out_loop_test_ch2:1;
        /** out_auto_wrback_ch2 : R/W; bitpos: [2]; default: 0;
         *  Configures whether to enable automatic outlink write-back when all the data in TX
         *  FIFO has been transmitted.
         *  0: Disable
         *  1: Enable
         */
        uint32_t out_auto_wrback_ch2:1;
        /** out_eof_mode_ch2 : R/W; bitpos: [3]; default: 1;
         *  Configures when to generate EOF flag.
         *  0: EOF flag for TX channel 2 is generated when data to be transmitted has been
         *  pushed into FIFO in AHB_DMA.
         *  1: EOF flag for TX channel 2 is generated when data to be transmitted has been
         *  popped from FIFO in AHB_DMA.
         */
        uint32_t out_eof_mode_ch2:1;
        /** outdscr_burst_en_ch2 : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable INCR burst transfer for TX channel 2 reading
         *  descriptors.
         *  0: Disable
         *  1: Enable
         */
        uint32_t outdscr_burst_en_ch2:1;
        uint32_t reserved_5:1;
        /** out_etm_en_ch2 : R/W; bitpos: [6]; default: 0;
         *  Configures whether to enable ETM control for TX channel 2.
         *  0: Disable
         *  1: Enable
         */
        uint32_t out_etm_en_ch2:1;
        uint32_t reserved_7:1;
        /** out_data_burst_mode_sel_ch2 : R/W; bitpos: [9:8]; default: 0;
         *  Configures max burst size for TX channel2.
         *  2'b00: single
         *  2'b01: incr4
         *  2'b10: incr8
         *  2'b11: incr16
         */
        uint32_t out_data_burst_mode_sel_ch2:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} ahb_dma_out_conf0_ch2_reg_t;

/** Type of out_conf1_ch2 register
 *  Configuration register 1 of TX channel 2
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** out_check_owner_ch2 : R/W; bitpos: [12]; default: 0;
         *  Configures whether to enable owner bit check for TX channel 2.
         *  0: Disable
         *  1: Enable
         */
        uint32_t out_check_owner_ch2:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} ahb_dma_out_conf1_ch2_reg_t;

/** Type of outfifo_status_ch2 register
 *  Receive FIFO status of RX channel 2
 */
typedef union {
    struct {
        /** outfifo_full_ch2 : RO; bitpos: [0]; default: 0;
         *  Represents whether L1 TX FIFO is full.
         *  0: Not Full
         *  1: Full
         */
        uint32_t outfifo_full_ch2:1;
        /** outfifo_empty_ch2 : RO; bitpos: [1]; default: 1;
         *  Represents whether L1 TX FIFO is empty.
         *  0: Not empty
         *  1: Empty
         */
        uint32_t outfifo_empty_ch2:1;
        uint32_t reserved_2:6;
        /** outfifo_cnt_ch2 : RO; bitpos: [14:8]; default: 0;
         *  Represents the number of data bytes in L1 TX FIFO for TX channel 2
         */
        uint32_t outfifo_cnt_ch2:7;
        uint32_t reserved_15:8;
        /** out_remain_under_1b_ch2 : RO; bitpos: [23]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_1b_ch2:1;
        /** out_remain_under_2b_ch2 : RO; bitpos: [24]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_2b_ch2:1;
        /** out_remain_under_3b_ch2 : RO; bitpos: [25]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_3b_ch2:1;
        /** out_remain_under_4b_ch2 : RO; bitpos: [26]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_4b_ch2:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} ahb_dma_outfifo_status_ch2_reg_t;

