espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_struct_eco2.h
/** Type of out_push_ch2 register
 *  Push control register of TX channel 2
 */
typedef union {
    struct {
        /** outfifo_wdata_ch2 : R/W; bitpos: [8:0]; default: 0;
         *  Configures whether to push data into AHB_DMA FIFO.
         *  0: Invalid. No effect
         *  1: Push
         */
        uint32_t outfifo_wdata_ch2:9;
        /** outfifo_push_ch2 : WT; bitpos: [9]; default: 0;
         *  Configures the data that need to be pushed into AHB_DMA FIFO.
         */
        uint32_t outfifo_push_ch2:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} ahb_dma_out_push_ch2_reg_t;

/** Type of out_link_ch2 register
 *  Push control register of TX channel 2
 */
typedef union {
    struct {
        /** outlink_stop_ch2 : WT; bitpos: [0]; default: 0;
         *  Configures whether to stop AHB_DMA's TX channel 2 from transmitting data.
         *  0: Invalid. No effect
         *  1: Stop
         */
        uint32_t outlink_stop_ch2:1;
        /** outlink_start_ch2 : WT; bitpos: [1]; default: 0;
         *  Configures whether to enable AHB_DMA's TX channel 2 for data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t outlink_start_ch2:1;
        /** outlink_restart_ch2 : WT; bitpos: [2]; default: 0;
         *  Configures whether to restart TX channel 2 for AHB_DMA transfer.
         *  0: Invalid. No effect
         *  1: Restart
         */
        uint32_t outlink_restart_ch2:1;
        /** outlink_park_ch2 : RO; bitpos: [3]; default: 1;
         *  Represents the status of the transmit descriptor's FSM.
         *  0: Running
         *  1: Idle
         */
        uint32_t outlink_park_ch2:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_out_link_ch2_reg_t;

/** Type of out_state_ch2 register
 *  Transmit status of TX channel 2
 */
typedef union {
    struct {
        /** outlink_dscr_addr_ch2 : RO; bitpos: [17:0]; default: 0;
         *  Represents the lower 18 bits of the address of the next transmit descriptor to be
         *  processed.
         */
        uint32_t outlink_dscr_addr_ch2:18;
        /** out_dscr_state_ch2 : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t out_dscr_state_ch2:2;
        /** out_state_ch2 : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t out_state_ch2:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} ahb_dma_out_state_ch2_reg_t;

/** Type of out_eof_des_addr_ch2 register
 *  Transmit descriptor address when EOF occurs on TX channel 2
 */
typedef union {
    struct {
        /** out_eof_des_addr_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the transmit descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t out_eof_des_addr_ch2:32;
    };
    uint32_t val;
} ahb_dma_out_eof_des_addr_ch2_reg_t;

/** Type of out_eof_bfr_des_addr_ch2 register
 *  The last transmit descriptor address when EOF occurs on TX channel 2
 */
typedef union {
    struct {
        /** out_eof_bfr_des_addr_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the transmit descriptor before the last transmit
         *  descriptor.
         */
        uint32_t out_eof_bfr_des_addr_ch2:32;
    };
    uint32_t val;
} ahb_dma_out_eof_bfr_des_addr_ch2_reg_t;

/** Type of out_dscr_ch2 register
 *  Current transmit descriptor address of TX channel 2
 */
typedef union {
    struct {
        /** outlink_dscr_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the next transmit descriptor y+1 pointed by the current
         *  transmit descriptor that has already been fetched.
         */
        uint32_t outlink_dscr_ch2:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_ch2_reg_t;

/** Type of out_dscr_bf0_ch2 register
 *  The last transmit descriptor address of TX channel 2
 */
typedef union {
    struct {
        /** outlink_dscr_bf0_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the current transmit descriptor y that has already been
         *  fetched.
         */
        uint32_t outlink_dscr_bf0_ch2:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_bf0_ch2_reg_t;

/** Type of out_dscr_bf1_ch2 register
 *  The second-to-last transmit descriptor address of TX channel 2
 */
typedef union {
    struct {
        /** outlink_dscr_bf1_ch2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the previous transmit descriptor y-1 that has already
         *  been fetched.
         */
        uint32_t outlink_dscr_bf1_ch2:32;
    };
    uint32_t val;
} ahb_dma_out_dscr_bf1_ch2_reg_t;

/** Type of out_peri_ch2 register
 *  Priority register of TX channel 2
 */
typedef union {
    struct {
        /** tx_pri_ch2 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the priority of TX channel 2.The larger of the value, the higher of the
         *  priority..
         */
        uint32_t tx_pri_ch2:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_out_peri_ch2_reg_t;

/** Type of out_peri_sel_ch2 register
 *  Peripheral selection register of TX channel 2
 */
typedef union {
    struct {
        /** peri_out_sel_ch2 : R/W; bitpos: [5:0]; default: 63;
         *  Configures the peripheral connected to TX channel 2.
         *  0: Dummy
         *  1: SPI2
         *  2: UHCI0
         *  3: I2S0
         *  4: Dummy
         *  5: Dummy
         *  6: AES
         *  7: SHA
         *  8: ADC_DAC
         *  9: PARL_IO
         *  10: Dummy
         *  11~15: Dummy
         *  \
         */
        uint32_t peri_out_sel_ch2:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} ahb_dma_out_peri_sel_ch2_reg_t;

/** Type of tx_ch_arb_weight_ch0 register
 *  TX channel 0 arbitration weight configuration register
 */
typedef union {
    struct {
        /** tx_arb_weight_value_ch0 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the weight(i.e the number of tokens) of TX channel0
         */
        uint32_t tx_arb_weight_value_ch0:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_tx_ch_arb_weight_ch0_reg_t;

/** Type of tx_arb_weight_opt_dir_ch0 register
 *  TX channel 0 weight arbitration optimization enable register
 */
typedef union {
    struct {
        /** tx_arb_weight_opt_dis_ch0 : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t tx_arb_weight_opt_dis_ch0:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} ahb_dma_tx_arb_weight_opt_dir_ch0_reg_t;

/** Type of tx_ch_arb_weight_ch1 register
 *  TX channel 1 arbitration weight configuration register
 */
typedef union {
    struct {
        /** tx_arb_weight_value_ch1 : R/W; bitpos: [3:0]; default: 0;
         *  Configures the weight(i.e the number of tokens) of TX channel1
         */
        uint32_t tx_arb_weight_value_ch1:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_tx_ch_arb_weight_ch1_reg_t;

