espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_struct_eco2.h
/** Group: Configuration Registers */
/** Type of rx_ch_arb_weigh_chn register
 *  RX channel 2 arbitration weight configuration register
 */
typedef union {
    struct {
        /** rx_ch_arb_weigh_chn : R/W; bitpos: [3:0]; default: 0;
         *  Configures the weight(i.e the number of tokens) of RX channeln
         */
        uint32_t rx_ch_arb_weigh_chn:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ahb_dma_rx_ch_arb_weigh_chn_reg_t;

/** Type of rx_arb_weigh_opt_dir_chn register
 *  RX channel 2 weight arbitration optimization enable register
 */
typedef union {
    struct {
        /** rx_arb_weigh_opt_dir_chn : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t rx_arb_weigh_opt_dir_chn:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} ahb_dma_rx_arb_weigh_opt_dir_chn_reg_t;

/** Type of arb_timeout_tx register
 *  TX arbitration timeout configuration register
 */
typedef union {
    struct {
        /** arb_timeout_tx : R/W; bitpos: [15:0]; default: 0;
         *  Configures the time slot for TX. Measurement unit: AHB bus clock cycle.
         */
        uint32_t arb_timeout_tx:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} ahb_dma_arb_timeout_tx_reg_t;

/** Type of arb_timeout_rx register
 *  RX arbitration timeout configuration register
 */
typedef union {
    struct {
        /** arb_timeout_rx : R/W; bitpos: [15:0]; default: 0;
         *  Configures the time slot for RX. Measurement unit: AHB bus clock cycle.
         */
        uint32_t arb_timeout_rx:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} ahb_dma_arb_timeout_rx_reg_t;

/** Type of weight_en_tx register
 *  TX weight arbitration enable register
 */
typedef union {
    struct {
        /** weight_en_tx : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable weight arbitration for TX.
         *  0: Disable
         *  1: Enable
         */
        uint32_t weight_en_tx:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} ahb_dma_weight_en_tx_reg_t;

/** Type of weight_en_rx register
 *  RX weight arbitration enable register
 */
typedef union {
    struct {
        /** weight_en_rx : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable weight arbitration for RX.
         *  0: Disable
         *  1: Enable
         */
        uint32_t weight_en_rx:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} ahb_dma_weight_en_rx_reg_t;


typedef struct {
    volatile ahb_dma_in_int_raw_ch0_reg_t in_int_raw_ch0;
    volatile ahb_dma_in_int_st_ch0_reg_t in_int_st_ch0;
    volatile ahb_dma_in_int_ena_ch0_reg_t in_int_ena_ch0;
    volatile ahb_dma_in_int_clr_ch0_reg_t in_int_clr_ch0;
    volatile ahb_dma_in_int_raw_ch1_reg_t in_int_raw_ch1;
    volatile ahb_dma_in_int_st_ch1_reg_t in_int_st_ch1;
    volatile ahb_dma_in_int_ena_ch1_reg_t in_int_ena_ch1;
    volatile ahb_dma_in_int_clr_ch1_reg_t in_int_clr_ch1;
    volatile ahb_dma_in_int_raw_ch2_reg_t in_int_raw_ch2;
    volatile ahb_dma_in_int_st_ch2_reg_t in_int_st_ch2;
    volatile ahb_dma_in_int_ena_ch2_reg_t in_int_ena_ch2;
    volatile ahb_dma_in_int_clr_ch2_reg_t in_int_clr_ch2;
    volatile ahb_dma_out_int_raw_ch0_reg_t out_int_raw_ch0;
    volatile ahb_dma_out_int_st_ch0_reg_t out_int_st_ch0;
    volatile ahb_dma_out_int_ena_ch0_reg_t out_int_ena_ch0;
    volatile ahb_dma_out_int_clr_ch0_reg_t out_int_clr_ch0;
    volatile ahb_dma_out_int_raw_ch1_reg_t out_int_raw_ch1;
    volatile ahb_dma_out_int_st_ch1_reg_t out_int_st_ch1;
    volatile ahb_dma_out_int_ena_ch1_reg_t out_int_ena_ch1;
    volatile ahb_dma_out_int_clr_ch1_reg_t out_int_clr_ch1;
    volatile ahb_dma_out_int_raw_ch2_reg_t out_int_raw_ch2;
    volatile ahb_dma_out_int_st_ch2_reg_t out_int_st_ch2;
    volatile ahb_dma_out_int_ena_ch2_reg_t out_int_ena_ch2;
    volatile ahb_dma_out_int_clr_ch2_reg_t out_int_clr_ch2;
    volatile ahb_dma_ahb_test_reg_t ahb_test;
    volatile ahb_dma_misc_conf_reg_t misc_conf;
    volatile ahb_dma_date_reg_t date;
    uint32_t reserved_06c;
    volatile ahb_dma_in_conf0_ch0_reg_t in_conf0_ch0;
    volatile ahb_dma_in_conf1_ch0_reg_t in_conf1_ch0;
    volatile ahb_dma_infifo_status_ch0_reg_t infifo_status_ch0;
    volatile ahb_dma_in_pop_ch0_reg_t in_pop_ch0;
    volatile ahb_dma_in_link_ch0_reg_t in_link_ch0;
    volatile ahb_dma_in_state_ch0_reg_t in_state_ch0;
    volatile ahb_dma_in_suc_eof_des_addr_ch0_reg_t in_suc_eof_des_addr_ch0;
    volatile ahb_dma_in_err_eof_des_addr_ch0_reg_t in_err_eof_des_addr_ch0;
    volatile ahb_dma_in_dscr_ch0_reg_t in_dscr_ch0;
    volatile ahb_dma_in_dscr_bf0_ch0_reg_t in_dscr_bf0_ch0;
    volatile ahb_dma_in_dscr_bf1_ch0_reg_t in_dscr_bf1_ch0;
    volatile ahb_dma_in_peri_ch0_reg_t in_peri_ch0;
    volatile ahb_dma_in_peri_sel_ch0_reg_t in_peri_sel_ch0;
    uint32_t reserved_0a4[11];
    volatile ahb_dma_out_conf0_ch0_reg_t out_conf0_ch0;
    volatile ahb_dma_out_conf1_ch0_reg_t out_conf1_ch0;
    volatile ahb_dma_outfifo_status_ch0_reg_t outfifo_status_ch0;
    volatile ahb_dma_out_push_ch0_reg_t out_push_ch0;
    volatile ahb_dma_out_link_ch0_reg_t out_link_ch0;
    volatile ahb_dma_out_state_ch0_reg_t out_state_ch0;
    volatile ahb_dma_out_eof_des_addr_ch0_reg_t out_eof_des_addr_ch0;
    volatile ahb_dma_out_eof_bfr_des_addr_ch0_reg_t out_eof_bfr_des_addr_ch0;
    volatile ahb_dma_out_dscr_ch0_reg_t out_dscr_ch0;
    volatile ahb_dma_out_dscr_bf0_ch0_reg_t out_dscr_bf0_ch0;
    volatile ahb_dma_out_dscr_bf1_ch0_reg_t out_dscr_bf1_ch0;
    volatile ahb_dma_out_peri_ch0_reg_t out_peri_ch0;
    volatile ahb_dma_out_peri_sel_ch0_reg_t out_peri_sel_ch0;
    uint32_t reserved_104[11];
    volatile ahb_dma_in_conf0_ch1_reg_t in_conf0_ch1;
    volatile ahb_dma_in_conf1_ch1_reg_t in_conf1_ch1;
    volatile ahb_dma_infifo_status_ch1_reg_t infifo_status_ch1;
    volatile ahb_dma_in_pop_ch1_reg_t in_pop_ch1;
    volatile ahb_dma_in_link_ch1_reg_t in_link_ch1;
    volatile ahb_dma_in_state_ch1_reg_t in_state_ch1;
    volatile ahb_dma_in_suc_eof_des_addr_ch1_reg_t in_suc_eof_des_addr_ch1;
    volatile ahb_dma_in_err_eof_des_addr_ch1_reg_t in_err_eof_des_addr_ch1;
    volatile ahb_dma_in_dscr_ch1_reg_t in_dscr_ch1;
    volatile ahb_dma_in_dscr_bf0_ch1_reg_t in_dscr_bf0_ch1;
    volatile ahb_dma_in_dscr_bf1_ch1_reg_t in_dscr_bf1_ch1;
    volatile ahb_dma_in_peri_ch1_reg_t in_peri_ch1;
    volatile ahb_dma_in_peri_sel_ch1_reg_t in_peri_sel_ch1;
    uint32_t reserved_164[11];
    volatile ahb_dma_out_conf0_ch1_reg_t out_conf0_ch1;
    volatile ahb_dma_out_conf1_ch1_reg_t out_conf1_ch1;
    volatile ahb_dma_outfifo_status_ch1_reg_t outfifo_status_ch1;
    volatile ahb_dma_out_push_ch1_reg_t out_push_ch1;
    volatile ahb_dma_out_link_ch1_reg_t out_link_ch1;
    volatile ahb_dma_out_state_ch1_reg_t out_state_ch1;
    volatile ahb_dma_out_eof_des_addr_ch1_reg_t out_eof_des_addr_ch1;
    volatile ahb_dma_out_eof_bfr_des_addr_ch1_reg_t out_eof_bfr_des_addr_ch1;
    volatile ahb_dma_out_dscr_ch1_reg_t out_dscr_ch1;
    volatile ahb_dma_out_dscr_bf0_ch1_reg_t out_dscr_bf0_ch1;
    volatile ahb_dma_out_dscr_bf1_ch1_reg_t out_dscr_bf1_ch1;
    volatile ahb_dma_out_peri_ch1_reg_t out_peri_ch1;
    volatile ahb_dma_out_peri_sel_ch1_reg_t out_peri_sel_ch1;
    uint32_t reserved_1c4[11];
    volatile ahb_dma_in_conf0_ch2_reg_t in_conf0_ch2;
    volatile ahb_dma_in_conf1_ch2_reg_t in_conf1_ch2;
    volatile ahb_dma_infifo_status_ch2_reg_t infifo_status_ch2;
    volatile ahb_dma_in_pop_ch2_reg_t in_pop_ch2;
    volatile ahb_dma_in_link_ch2_reg_t in_link_ch2;
    volatile ahb_dma_in_state_ch2_reg_t in_state_ch2;
    volatile ahb_dma_in_suc_eof_des_addr_ch2_reg_t in_suc_eof_des_addr_ch2;
    volatile ahb_dma_in_err_eof_des_addr_ch2_reg_t in_err_eof_des_addr_ch2;
    volatile ahb_dma_in_dscr_ch2_reg_t in_dscr_ch2;
    volatile ahb_dma_in_dscr_bf0_ch2_reg_t in_dscr_bf0_ch2;
    volatile ahb_dma_in_dscr_bf1_ch2_reg_t in_dscr_bf1_ch2;
    volatile ahb_dma_in_peri_ch2_reg_t in_peri_ch2;
    volatile ahb_dma_in_peri_sel_ch2_reg_t in_peri_sel_ch2;
    uint32_t reserved_224[11];
    volatile ahb_dma_out_conf0_ch2_reg_t out_conf0_ch2;
    volatile ahb_dma_out_conf1_ch2_reg_t out_conf1_ch2;
    volatile ahb_dma_outfifo_status_ch2_reg_t outfifo_status_ch2;
    volatile ahb_dma_out_push_ch2_reg_t out_push_ch2;
    volatile ahb_dma_out_link_ch2_reg_t out_link_ch2;
    volatile ahb_dma_out_state_ch2_reg_t out_state_ch2;
    volatile ahb_dma_out_eof_des_addr_ch2_reg_t out_eof_des_addr_ch2;
    volatile ahb_dma_out_eof_bfr_des_addr_ch2_reg_t out_eof_bfr_des_addr_ch2;
    volatile ahb_dma_out_dscr_ch2_reg_t out_dscr_ch2;
    volatile ahb_dma_out_dscr_bf0_ch2_reg_t out_dscr_bf0_ch2;
    volatile ahb_dma_out_dscr_bf1_ch2_reg_t out_dscr_bf1_ch2;
    volatile ahb_dma_out_peri_ch2_reg_t out_peri_ch2;
    volatile ahb_dma_out_peri_sel_ch2_reg_t out_peri_sel_ch2;
    uint32_t reserved_284[22];
    volatile ahb_dma_tx_ch_arb_weight_ch0_reg_t tx_ch_arb_weight_ch0;
    volatile ahb_dma_tx_arb_weight_opt_dir_ch0_reg_t tx_arb_weight_opt_dir_ch0;
    uint32_t reserved_2e4[8];
    volatile ahb_dma_tx_ch_arb_weight_ch1_reg_t tx_ch_arb_weight_ch1;
    volatile ahb_dma_tx_arb_weight_opt_dir_ch1_reg_t tx_arb_weight_opt_dir_ch1;
    uint32_t reserved_30c[8];
    volatile ahb_dma_tx_ch_arb_weight_ch2_reg_t tx_ch_arb_weight_ch2;
    volatile ahb_dma_tx_arb_weight_opt_dir_ch2_reg_t tx_arb_weight_opt_dir_ch2;
    uint32_t reserved_334[8];
    volatile ahb_dma_rx_ch_arb_weight_ch0_reg_t rx_ch_arb_weight_ch0;
    volatile ahb_dma_rx_arb_weight_opt_dir_ch0_reg_t rx_arb_weight_opt_dir_ch0;
    uint32_t reserved_35c[8];
    volatile ahb_dma_rx_ch_arb_weight_ch1_reg_t rx_ch_arb_weight_ch1;
    volatile ahb_dma_rx_arb_weight_opt_dir_ch1_reg_t rx_arb_weight_opt_dir_ch1;
    uint32_t reserved_384[8];
    volatile ahb_dma_rx_ch_arb_weigh_chn_reg_t rx_ch_arb_weigh_ch2;
    volatile ahb_dma_rx_arb_weigh_opt_dir_chn_reg_t rx_arb_weigh_opt_dir_ch2;
    volatile ahb_dma_in_link_addr_ch0_reg_t in_link_addr_ch0;
    volatile ahb_dma_in_link_addr_ch1_reg_t in_link_addr_ch1;
    volatile ahb_dma_in_link_addr_ch2_reg_t in_link_addr_ch2;
    volatile ahb_dma_out_link_addr_ch0_reg_t out_link_addr_ch0;
    volatile ahb_dma_out_link_addr_ch1_reg_t out_link_addr_ch1;
    volatile ahb_dma_out_link_addr_ch2_reg_t out_link_addr_ch2;
    volatile ahb_dma_intr_mem_start_addr_reg_t intr_mem_start_addr;
    volatile ahb_dma_intr_mem_end_addr_reg_t intr_mem_end_addr;
    volatile ahb_dma_arb_timeout_tx_reg_t arb_timeout_tx;
    volatile ahb_dma_arb_timeout_rx_reg_t arb_timeout_rx;
    volatile ahb_dma_weight_en_tx_reg_t weight_en_tx;
    volatile ahb_dma_weight_en_rx_reg_t weight_en_rx;
    volatile ahb_dma_arb_timeout_reg_t arb_timeout;
    uint32_t reserved_3e0[8];
    volatile ahb_dma_weight_en_reg_t weight_en;
    volatile ahb_dma_module_clk_en_reg_t module_clk_en;
    volatile ahb_dma_ahbinf_resp_err_status0_reg_t ahbinf_resp_err_status0;
    volatile ahb_dma_ahbinf_resp_err_status1_reg_t ahbinf_resp_err_status1;
    volatile ahb_dma_in_done_des_addr_ch0_reg_t in_done_des_addr_ch0;
    volatile ahb_dma_out_done_des_addr_ch0_reg_t out_done_des_addr_ch0;
    volatile ahb_dma_in_done_des_addr_ch1_reg_t in_done_des_addr_ch1;
    volatile ahb_dma_out_done_des_addr_ch1_reg_t out_done_des_addr_ch1;
    volatile ahb_dma_in_done_des_addr_ch2_reg_t in_done_des_addr_ch2;
    volatile ahb_dma_out_done_des_addr_ch2_reg_t out_done_des_addr_ch2;
} ahb_dma_dev_t;

extern ahb_dma_dev_t AHB_DMA;

#ifndef __cplusplus
_Static_assert(sizeof(ahb_dma_dev_t) == 0x428, "Invalid size of ahb_dma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
